dictionary = {
    "client": "Покупатель",
    "sidorov": "Сидоров",
    "putin": "Путин",
    "car": "Машина",
    "moskvich 412": "Москвич 412 - на дороге за ним не угнаться!",
    "tavria": "Таврия",
    "product": "Продукт",
    "baton": "Батон",
    "benzin": "Бензин",
    "seller": "Продавец",
    "ivanov": "Иванов",
    "petrov": "Петров",
    "amount": "Количество",
    "1": "1 ед.",
    "2": "2 ед.",
    "3": "3 ед.",
    "cost": "Стоимость",
    "100rub": "100 рублей",
    "200rub": "200 рублей",
    "300rub": "300 рублей",
    "sell": "Продажа",
    "putin`s products": "Путин купил",
    "sidorov`s products": "Сидоров купил",
}

clients = [
    "Сидоров",
    "Путин",
]

sellers = [
    "Иванов",
    "Петров"
]

products = [
    "бензин",
    "батон"
]