dictionary = {
    "deadline": "Срок сдачи",
    "10.10.2021": "10.10.2021",
    "11.11.2021": "11.11.2021",
    "stage": "Этап",
    "planing": "Планирование",
    "developing": "Разработка",
    "supporting": "Поддержка",
    "employee": "Сотрудник",
    "petrov": "Петров",
    "sidorov": "Сидоров",
    "subj": "Предметная область",
    "other apps": "Другие приложения",
    "mobile apps": "Мобильные приложения",
    "name": "Название",
    "space catapult": "Космическая катапульта",
    "mobile app for migrants": "Мобильное приложение для космомигрантов",
    "lang": "Язык программирования",
    "java": "java",
    "python": "python",
    "js": "js",
}

emps = [
    "Петров",
    "Сидоров"
]

projects = [
    "Космическая катапульта",
    "Мобильное приложение для космомигрантов",
]

langs = [
    "java",
    "python",
    "js"
]